{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 1], [26, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad0", 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm4", 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 1], [46, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm5", 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm6", 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm7", 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 1], [74, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm8", 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0], [82, 0, 1], [83, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm9", 
      "inputs": [[88, 0, 0], [89, 0, 0], [90, 0, 0], [91, 0, 1], [92, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm10", 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 1], [102, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm11", 
      "inputs": [[107, 0, 0], [108, 0, 0], [109, 0, 0], [110, 0, 1], [111, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm12", 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 1], [120, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv6_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm13", 
      "inputs": [[125, 0, 0], [126, 0, 0], [127, 0, 0], [128, 0, 1], [129, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "LinearRegressionOutput", 
      "name": "linearregressionoutput0", 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    20, 
    21, 
    23, 
    24, 
    25, 
    26, 
    29, 
    30, 
    32, 
    33, 
    34, 
    35, 
    40, 
    41, 
    43, 
    44, 
    45, 
    46, 
    49, 
    50, 
    52, 
    53, 
    54, 
    55, 
    58, 
    59, 
    61, 
    62, 
    63, 
    64, 
    68, 
    69, 
    71, 
    72, 
    73, 
    74, 
    77, 
    78, 
    80, 
    81, 
    82, 
    83, 
    86, 
    87, 
    89, 
    90, 
    91, 
    92, 
    96, 
    97, 
    99, 
    100, 
    101, 
    102, 
    105, 
    106, 
    108, 
    109, 
    110, 
    111, 
    114, 
    115, 
    117, 
    118, 
    119, 
    120, 
    123, 
    124, 
    126, 
    127, 
    128, 
    129, 
    132
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    159, 
    160, 
    161, 
    162
  ], 
  "heads": [[133, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1200]}
}